results/results_m5_large/results_m5_large_run1/oltp_read_only_t16/sysbench.log
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 16 tps: 79.68 qps: 1291.15 (r/w/o: 1130.19/0.00/160.97) lat (ms,95%): 314.45 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 74.60 qps: 1188.43 (r/w/o: 1039.32/0.00/149.10) lat (ms,95%): 369.77 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 80.00 qps: 1283.21 (r/w/o: 1123.11/0.00/160.10) lat (ms,95%): 314.45 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 79.20 qps: 1268.10 (r/w/o: 1109.80/0.00/158.30) lat (ms,95%): 320.17 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 76.50 qps: 1223.90 (r/w/o: 1070.80/0.00/153.10) lat (ms,95%): 325.98 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 78.80 qps: 1256.59 (r/w/o: 1099.09/0.00/157.50) lat (ms,95%): 320.17 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 16 tps: 67.80 qps: 1088.90 (r/w/o: 953.20/0.00/135.70) lat (ms,95%): 404.61 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 16 tps: 71.00 qps: 1133.30 (r/w/o: 991.40/0.00/141.90) lat (ms,95%): 442.73 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 16 tps: 75.60 qps: 1209.10 (r/w/o: 1057.80/0.00/151.30) lat (ms,95%): 376.49 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 16 tps: 77.90 qps: 1245.10 (r/w/o: 1089.40/0.00/155.70) lat (ms,95%): 325.98 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 16 tps: 81.40 qps: 1304.81 (r/w/o: 1141.91/0.00/162.90) lat (ms,95%): 297.92 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 16 tps: 74.30 qps: 1185.90 (r/w/o: 1037.30/0.00/148.60) lat (ms,95%): 356.70 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            128576
        write:                           0
        other:                           18368
        total:                           146944
    transactions:                        9184   (76.30 per sec.)
    queries:                             146944 (1220.80 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      76.3000
    time elapsed:                        120.3669s
    total number of events:              9184

Latency (ms):
         min:                                   99.25
         avg:                                  209.46
         max:                                  796.07
         95th percentile:                      344.08
         sum:                              1923716.72

Threads fairness:
    events (avg/stddev):           574.0000/3.28
    execution time (avg/stddev):   120.2323/0.08